icssw-org/MeshCom-Firmware/src/nrf52/nrf_eth.cpp
/**
   @brief  Sets up a UDP client to transmit the buffers we receive from Lora
**/

#include <SPI.h>
#include "instrument.h"   // INSTRUMENT_ENABLED for the --srvip bench hook below
#include <RAK13800_W5100S.h> // Click to install library: http://librarymanager/All#RAK13800_W5100S
#include <Arduino.h>
#include <nrf_eth.h>
#include <debugconf.h>
#include <loop_functions.h>
#include <loop_functions_extern.h>
#include "dedup_functions.h"
#include <command_functions.h>
#include <time_functions.h>
#include <lora_setchip.h>
#include <lora_functions.h>
#include <extudp_functions.h>

#include "ntp_async.h"
#include <time.h>

#include "printfdeb_functions.h"

#include "via_functions.h"
#include "regex_functions.h"
#include "conf_frame.h"
#include "setlog_lines.h"

EthernetUDP Udp;

NtpAsync timeClient(Udp);   // TM-35: non-blocking, reply harvested in getUDP()

bool btimeClient = false;

// TM-38 follow-up / TM-39: the ESP32 side's bUDPLOG (udp_functions.cpp,
// --udplog on/off there) is declared inside "#if defined(ESP32)" in both
// udp_functions.cpp and udp_functions.h, so it does not exist as a symbol
// in the nRF52 build at all -- a plain "extern bool bUDPLOG;" here fails to
// link. Same name, same default, own definition; see the report for the
// 4-line nRF52 command-table hook that would let an operator flip it (no
// such command exists yet -- command_functions.cpp is not in this file set).
bool bUDPLOG = false;

// byte macaddr[] = {0xDE, 0xAD, 0xBE, 0xEF, 0xFE, 0xEC}; // Set the MAC address, do not repeat in a network.
uint8_t macaddr[6] = {0};

unsigned char inc_udp_buffer[UDP_TX_BUF_SIZE+5]; // Buffer to hold incoming packet.

String s_node_ip;
String s_node_hostip;

#if INSTRUMENT_ENABLED
// One free function so command_functions.cpp can re-apply the override without
// pulling nrf_eth.h (and the whole RAK13800 driver) into a file that every
// platform compiles.
void nrfEthRestartUDP();

// TM-31 bench hook, nRF52 definition. The ESP32 copy in udp_functions.cpp sits
// inside that file's `#ifdef ESP32` block -- the file compiles for nRF52 but
// the symbol does not, so it has to be defined here or the link fails with
// "undefined reference to bench_srvip" from both command_functions.cpp and
// startUDP(). Exactly one definition per build either way.
IPAddress bench_srvip = IPAddress(0, 0, 0, 0);
#endif
String strSource_call;

// ---- TM-35 / N-20 instrumentation ------------------------------------------
#if !defined(ETH_STALL_MS)
  #define ETH_STALL_MS 50
#endif

struct EthStall
{
  const char *site;
  uint32_t t0;
  EthStall(const char *s) : site(s), t0(millis()) {}
  ~EthStall()
  {
    uint32_t d = (uint32_t)(millis() - t0);
    if(d >= ETH_STALL_MS)
      Serial.printf("[ETH];stall;%s;ms;%lu;task;%s\n", site, (unsigned long)d, pcTaskGetName(NULL));
  }
};

static int      s_ethLinkState = -1;      // -1 unknown, 0 down, 1 up
static uint32_t s_ethLinkSinceMs = 0;     // last link edge
static uint32_t s_ethLinkDowns = 0;
static uint32_t s_ethGotIpCount = 0;
static uint32_t s_ethLastGotIpMs = 0;
static uint32_t s_ethDhcpRenews = 0;
static uint32_t s_ethDhcpFails = 0;
static uint32_t s_ethResets = 0;          // resetDHCP()/--ethdrop
static uint32_t s_ethUdpRx = 0;
static uint32_t s_ethUdpTxFail = 0;
static uint32_t s_ethUdpRxMaxMs = 0;
static uint32_t s_ethUdpTxMaxMs = 0;
extern NrfETH neth;

// Link-Zustand aus dem W5100S-Register (ein SPI-Lesen). Kante -> Ereignis.
void ethLinkPoll()
{
  if(!neth.hasETHHardware)
    return;
  static uint32_t s_last = 0;
  if(s_last != 0 && (uint32_t)(millis() - s_last) < 1000)
    return;
  s_last = millis();

  EthernetLinkStatus st;
  { EthStall x("link"); st = Ethernet.linkStatus(); }
  int up = (st == LinkOFF) ? 0 : 1;   // Unknown zaehlt wie bisher (hasETHlink) als up
  if(up != s_ethLinkState)
  {
    if(s_ethLinkState != -1 && up == 0)
      s_ethLinkDowns++;
    s_ethLinkState = up;
    s_ethLinkSinceMs = millis();
    Serial.printf("[ETH];event;link;%s;ip;%d;ms;%lu\n", up ? "up" : "down", neth.hasIPaddress ? 1 : 0, (unsigned long)millis());
  }
}

static void ethLinkLog(const char *tag)
{
  unsigned long now = millis();
  IPAddress ip = Ethernet.localIP();
  Serial.printf("[ETH];%s;%s;link;%d;link_age_s;%lu;ip;%d.%d.%d.%d;dest;%s;hb_age_s;%lu;got_ip_n;%lu;downs;%lu;renews;%lu;renew_fail;%lu;resets;%lu;rx_n;%lu;rx_max_ms;%lu;tx_fail;%lu;tx_max_ms;%lu;ms;%lu\n",
    tag, neth.hasIPaddress ? "up" : "down", s_ethLinkState,
    (unsigned long)(s_ethLinkSinceMs ? (now - s_ethLinkSinceMs) / 1000 : 0),
    ip[0], ip[1], ip[2], ip[3], s_node_hostip.c_str(),
    (unsigned long)(neth.last_upd_timer ? (now - neth.last_upd_timer) / 1000 : 0),
    (unsigned long)s_ethGotIpCount, (unsigned long)s_ethLinkDowns,
    (unsigned long)s_ethDhcpRenews, (unsigned long)s_ethDhcpFails, (unsigned long)s_ethResets,
    (unsigned long)s_ethUdpRx, (unsigned long)s_ethUdpRxMaxMs,
    (unsigned long)s_ethUdpTxFail, (unsigned long)s_ethUdpTxMaxMs, now);
}

void ethLinkHeartbeat()
{
  if(!neth.hasETHHardware)
    return;
  static uint32_t s_last = 0;
  if(s_last != 0 && (uint32_t)(millis() - s_last) < 60000)
    return;
  s_last = millis();
  ethLinkLog("link");
}

void ethStat()
{
  ethLinkLog("stat");
  Serial.printf("[ETH];stat;hw;%d;hasip;%d;busy;%d;last_got_ip_ms;%lu;stall_ms;%d\n",
    neth.hasETHHardware ? 1 : 0, neth.hasIPaddress ? 1 : 0, neth.udp_is_busy ? 1 : 0,
    (unsigned long)s_ethLastGotIpMs, (int)ETH_STALL_MS);
}

// ETH-03 measurement (2026-09-17, docs/BACKLOG.md sec 3.8at): the fault is a
// false hasIPaddress=false clear while the W5100S is demonstrably still up
// (answers ARP/ICMP) -- --info and [ETH] both say "no IP" at the same
// instant the chip disagrees. Four sites clear the flag (:169 below,
// :281/:294 in initethDHCP(), :567 in resetDHCP()); this is the raw,
// unconditional marker fired at each one, carrying both sides of that
// disagreement in a single line: the decision value that drove the clear
// (a DHCP/startETH() return code, or -1 for the one unconditional site) and
// the chip's own linkStatus()/localIP() read at that exact instant.
//
// Raw Serial.printf, not printfdeb/DEBUG_MSG: the node under test runs with
// --setlog and bDEBUG both off, so a gated line would never have appeared
// here -- which is exactly why this bug needed a measurement pass instead of
// a grep through the existing log. Left unconditional in shipping images
// too, matching every other [ETH];event;.../[ETH];drop;... line already in
// this file (ethDrop() below, ethLinkPoll(), resetDHCP(), checkDHCP()), all
// of which are already always-on -- one more raw line at these four sites
// does not change that policy, it is consistent with it.
//
// site: a fixed id (169/281/294/567), not a live line number -- these match
// the site names docs/BACKLOG.md sec 3.8at already published for this bug
// before this instrumentation existed, and adding these markers moves every
// later line in the file, so a live line number would drift out of sync
// with the doc on the next edit. rc: startETH()'s return code at 281/294/567
// (2 = no ETH hardware, 1 = DHCP no answer), or -1 at 169 where there is no
// decision value to report. linkst: Ethernet.linkStatus() at this instant,
// raw EthernetLinkStatus enum value (0 Unknown, 1 LinkON, 2 LinkOFF) --
// the library's own numbering, not remapped, so it can be checked against
// RAK13800_W5100S.h directly. ip: Ethernet.localIP() at this instant.
//
// Measurement only, per the brief: no control-flow change, no guard, no
// retry added here -- a fix applied before this measurement would destroy
// the evidence the next capture needs.
//
// Counters: NOT extended for this pass. The existing s_ethResets/
// s_ethLinkDowns/s_ethGotIpCount/s_ethDhcpFails feed the 60-s
// [ETH];link;... heartbeat, but none of them increments at 169/281/294/567
// today, and folding a new counter into that heartbeat's fixed field list
// risks breaking whatever already parses it. Each [ETH];clear;site;... line
// below is already its own countable, greppable event carrying the site
// number, so a shared counter would be redundant with what these four lines
// already give the next capture.
static void ethClearLog(int site, int rc)
{
  Serial.printf("[ETH];clear;site;%d;rc;%d;linkst;%d;ip;%d.%d.%d.%d;ms;%lu\n",
                site, rc, (int)Ethernet.linkStatus(),
                Ethernet.localIP()[0], Ethernet.localIP()[1],
                Ethernet.localIP()[2], Ethernet.localIP()[3],
                (unsigned long)millis());
}

// Bench-/Feldhaken: der Wiederherstellungspfad der Firmware (resetDHCP: UDP
// stoppen, DHCP erneuern, UDP neu starten), mit Zeit. Kein Kabel-Ereignis --
// das kann nur der Operator ausloesen (N-20-Soak).
void ethDrop()
{
  if(!neth.hasETHHardware)
  {
    Serial.println("[ETH];drop;err;no ETH hardware");
    return;
  }
  uint32_t t0 = millis();
  Serial.printf("[ETH];drop;ms;%lu\n", (unsigned long)t0);
  ethClearLog(169, -1);   // -1: no decision value here, this clear is the unconditional
                          // operator trigger (--ethdrop), not a DHCP/init outcome
  neth.hasIPaddress = false;
  int rc = neth.resetDHCP();
  Serial.printf("[ETH];drop;done;rc;%d;took_ms;%lu;ip;%d;ms;%lu\n", rc, (unsigned long)(millis() - t0), neth.hasIPaddress ? 1 : 0, (unsigned long)millis());
}
// ------------------------------------------------------------------------------

