icssw-org/MeshCom-Firmware/src/nrf52/nrf_eth.cpp
String NrfETH::getNodeIP()
{
  return s_node_ip;
}

/**@brief init of ETH board with fix IP
 */
void NrfETH::initethfixIP()
{
  if(hasIPaddress)
    return;

  IPAddress ip(192, 168, 100, 100); // Set IP address,dependent on your local network.
  IPAddress dns(8, 8, 8, 8);
  IPAddress gw(192, 168, 100, 1);
  IPAddress subnet(255, 255, 255, 0);

  // händische IP Vergabe
  snprintf(meshcom_settings.node_ip, sizeof(meshcom_settings.node_ip), "%s", meshcom_settings.node_ownip);
  snprintf(meshcom_settings.node_gw, sizeof(meshcom_settings.node_gw), "%s", meshcom_settings.node_owngw);
  if(memcmp(meshcom_settings.node_ownip, "44", 2) == 0)
    snprintf(meshcom_settings.node_dns, sizeof(meshcom_settings.node_dns), "%s", (char*)"44.143.0.10");
  else
    snprintf(meshcom_settings.node_dns, sizeof(meshcom_settings.node_dns), "%s", (char*)"8.8.8.8");
  snprintf(meshcom_settings.node_subnet, sizeof(meshcom_settings.node_subnet), "%s", meshcom_settings.node_ownms);

  // Set your Static IP address
  ip.fromString(meshcom_settings.node_ip);
  // Set your Gateway IP address
  gw.fromString(meshcom_settings.node_gw);
  // Set your Gateway IP mask
  subnet.fromString(meshcom_settings.node_subnet);
  // set DNS
  dns.fromString(meshcom_settings.node_dns);

  // init Hardware
  initETH_HW();

  // get mac addr
  getMyMac();

  Ethernet.begin(macaddr, ip, dns, gw, subnet);

  int iWaitStatus=5;
  
  while (Ethernet.linkStatus() == LinkOFF)
  {
    if(iWaitStatus == 1)
      printfdeb("ERROR: Ethernet cable is not connected (%i).\n", iWaitStatus);
      
    delay(500);
    
    iWaitStatus--;
    
    if(iWaitStatus < 1)
      return;
  }

  // diese Meldungen gehen nicht zu TELNET-Console
  Serial.print("\nMy IP address: ");
  Serial.println(ip); // Print your local IP address.
  Serial.print("Default GW address: ");
  Serial.println(gw);
  Serial.print("DNS address: ");
  Serial.println(dns);
  Serial.print("SNM: ");
  Serial.println(subnet);
  Serial.println("");

  hasIPaddress = true;

  last_upd_timer = millis();

  // start the UDP service
  startFIXUDP();

  // update phone status
  if (isPhoneReady == 1)
  {
    commandAction((char *)"--wifiset", true);
  }
}


/**@brief init of ETH board with DHCP
 */
void NrfETH::initethDHCP()
{
  // init Hardware
  initETH_HW();

  // get mac addr
  getMyMac();

  if(!hasETHHardware)
  {
    printlndeb("no ETH hardware found");
    return;
  }

  // get DHCP IP config, returns 0 if success
  int retStart = startETH();

  if(retStart == 2)
  {
    // not ETH-hardware found
    ethClearLog(281, retStart);
    hasIPaddress = false;
    return;
  }
  else
  if(retStart == 0)
  {
    // start the UDP service
    startUDP();
  }
  else
  {
    printlndeb("ERROR: DHCP No Answer");
    printlndeb("ERROR: Set to fixed IP!");
    ethClearLog(294, retStart);
    hasIPaddress = false;
  }
}


// C2 carve-out (DRY unification U2): the three socket primitives of the
// datagram write, paired one for one with the _esp32 set in udp_functions.h,
// so a native test can replace them with a recording sink.
//
// Three and not one, for two independent reasons. The caller's error policy
// runs *between* them on ESP32: a failed write that trips MAX_ERR_UDP_TX
// resets the socket and returns without ever calling endPacket(). And the
// debug print here sits between beginPacket() and the write loop -- keeping
// begin and write apart preserves that order exactly, which matters because
// beginPacket() is an SPI transaction to the W5100S, not a local setup call.
//
// The write half returns true unconditionally, which is not an oversight in
// the carve but the behaviour as it stands: this path writes byte by byte and
// never looks at Udp.write()'s result, so the only failure nRF52 can report is
// endPacket()'s. ESP32 checks the write and can reset the socket on it. That
// asymmetry is D1 drift-matrix material; preserved here, not fixed.
bool udpBeginRaw_nrf52()
{
  return Udp.beginPacket(neth.udp_dest_addr, UDP_PORT) != 0;
}

bool udpWriteRaw_nrf52(const uint8_t *buf, uint16_t len)
{
  for (int i=0; i<len; i++)
  {
    Udp.write(buf[i]);
  }

  return true;
}

bool udpEndRaw_nrf52()
{
  return Udp.endPacket();
}

/**@brief Method to send UDP packets
 * returns true if packet was sent successful
 */
bool NrfETH::sendUDP(uint8_t buffer [UDP_TX_BUF_SIZE], uint16_t rx_buf_size)
{
  EthStall st("udp_tx");
  uint32_t t0 = millis();
  udpBeginRaw_nrf52();
  
  if(bDEBUG)
  {
    printdeb("UDP Out Buff:");
    printBuffer(buffer, rx_buf_size);
  }

  udpWriteRaw_nrf52(buffer, rx_buf_size);

  bool ok = udpEndRaw_nrf52();
  uint32_t d = (uint32_t)(millis() - t0);
  if(d > s_ethUdpTxMaxMs) s_ethUdpTxMaxMs = d;
  if(!ok) s_ethUdpTxFail++;

  // TM-38 follow-up: per-datagram parity marker, see getUDP() above.
  // nRF52's IPAddress (Adafruit core) has no toString() -- format by octet,
  // same pattern as startUDP()/getMyMac() elsewhere in this file.
  if(bUDPLOG)
    Serial.printf("[UDP];tx;ip;%d.%d.%d.%d;port;%u;len;%u;ok;%d;ms;%lu\n",
                   udp_dest_addr[0], udp_dest_addr[1], udp_dest_addr[2], udp_dest_addr[3],
                   (unsigned)UDP_PORT, (unsigned)rx_buf_size,
                   ok ? 1 : 0, (unsigned long)millis());

  return ok;
}

/**@brief Method to check UDP packets
 */
int NrfETH::checkUDP()
{
  if(Udp.check() < 0)
  {
    printlndeb("[UDP ERROR] checkUDP");
    return -1;
  }

  return 0;

}

/**@brief TM-45: harvest-only substitute for getUDP(), for a bGATEWAY-off
 * node (nrf52_main.cpp only calls getUDP() from the bGATEWAY-on branch, so
 * without this the reply to timeClient's own sendRequest() never gets
 * read). Same socket, same NtpAsync instance -- but none of getUDP()'s
 * GATE/CONF/BEAT parsing or gateway bookkeeping (last_upd_timer, [GW];rx,
 * ...), since there is no gateway consumer for a non-NTP datagram here.
 */
void NrfETH::harvestNTP()
{
  if(!hasIPaddress)
    return;

  ntpHarvestReply(Udp, timeClient);
}


/**@brief Method to receive UDP packets
 */
int NrfETH::getUDP()
{
  udp_is_busy = true;   //setting the busy flag

  int packetSize;
  uint32_t t0 = millis();
  { EthStall st("udp_rx"); packetSize = Udp.parsePacket(); } // If there's data available, read a packet.

  // HEARTBEAT keine Ausgabe
  //if(packetSize != 22 && packetSize > 0 && bDEBUG)
  if(packetSize > 0 && bDEBUG)
    printfdeb("[UDP_ETH] UDP Packet received with length: %i\n", packetSize);

