icssw-org/MeshCom-Firmware/src/nrf52/nrf_eth.cpp
  if (packetSize <= UDP_TX_BUF_SIZE && packetSize > 0)
  {
    IPAddress remote_ip = Udp.remoteIP();
    uint16_t remote_port = Udp.remotePort();

    // read the packet
    { EthStall st("udp_read"); Udp.read(inc_udp_buffer, UDP_TX_BUF_SIZE); } // Read the packet into packetBufffer.
    s_ethUdpRx++;

    // TM-38 follow-up: per-datagram parity marker with the ESP32/RAK-WiFi
    // [UDP];rx (udp_functions.cpp getMeshComUDP()). Gated by the same
    // bUDPLOG flag -- default false here too, but nRF52 has no --udplog
    // command yet (command_functions.cpp is not in this file set); see the
    // report for the 4-line command-table hook needed to toggle it.
    if(bUDPLOG)
      Serial.printf("[UDP];rx;ip;%d.%d.%d.%d;port;%u;len;%d;ms;%lu\n",
                     remote_ip[0], remote_ip[1], remote_ip[2], remote_ip[3],
                     (unsigned)remote_port, packetSize, (unsigned long)millis());
    { uint32_t d = (uint32_t)(millis() - t0); if(d > s_ethUdpRxMaxMs) s_ethUdpRxMaxMs = d; }

    // TM-35: the NTP reply shares this socket with the gateway traffic
    if(timeClient.tryConsume(remote_ip, remote_port, inc_udp_buffer, packetSize))
    {
      memset(inc_udp_buffer, 0, UDP_TX_BUF_SIZE);
      udp_is_busy = false;
      return 0;
    }

    if(handleUdpFrame_nrf52(inc_udp_buffer, packetSize, remote_ip) == 0)
    {
      // zero out the inc buffer
      memset(inc_udp_buffer, 0, UDP_TX_BUF_SIZE);

      udp_is_busy = false;   //setting the busy flag
      return 0;
    }
    else
    {
      printfdeb("[ERROR] UDP Message has too much Zeros\n");
      resetDHCP();
    }
  }

  // zero out the inc buffer
  memset(inc_udp_buffer, 0, UDP_TX_BUF_SIZE);
  
  udp_is_busy = false;   //setting the busy flag
  return 1;
}

/**@brief Method to receive UDP packets
 */
void NrfETH::fillUDP_RING_BUFFER(uint8_t buffer [UDP_TX_BUF_SIZE], uint16_t rx_buf_size)
{
  // first byte is always the len of the msg
  // UDP messages send to LoRa TX
  ringBuffer[iWrite][0] = rx_buf_size;
  ringBuffer[iWrite][1] = 0xFF;
  memcpy(ringBuffer[iWrite] + 2, buffer, rx_buf_size);

  DEBUG_MSG_VAL("RADIO", (int)iWrite, "fill LORA Send:");

  iWrite++;
  if (iWrite >= MAX_RING) // if the buffer is full we start at index 0 -> take care of overwriting!
    iWrite = 0;

}

/**@brief Method to check Link Status
 */
bool NrfETH::hasETHlink()
{
  EthStall st("link");
  if (Ethernet.linkStatus() == LinkON)
  {
    DEBUG_MSG("ETH", "Has Link UP");
    return 1;
  }
  if (Ethernet.linkStatus() == LinkOFF)
  {
    DEBUG_MSG("ETH", "Has no link!");
    return 0;
  }
  if (Ethernet.linkStatus() == Unknown)
  {
    DEBUG_MSG("ETH", "Unknown link status");
    return 1;
  }
  return 0;
}

/**@brief Method to get HW ID of nrf chip and use it as mac address and set GW_ID with last 4 bytes 
 */
void NrfETH::getMyMac()
{
  /*https://devzone.nordicsemi.com/f/nordic-q-a/22089/specific-unique-id-for-device-detection/86795#86795

   * NRF_FICR->DEVICEADDR[] is array of 32-bit words.
   * NRF_FICR->DEVICEADDR yields type (unit32_t*)
   * Cast: (uint64_t*) NRF_FICR->DEVICEADDR yields type (unit64_t*)
   * Dereferencing: *(uint64_t*) NRF_FICR->DEVICEADDR yields type uint64_t
   *
   * Nordic doc asserts upper two bytes read all ones.
   */

  uint64_t result = *(uint64_t *)NRF_FICR->DEVICEADDR;

  // Mask off upper bytes, to match over-the-air length of 6 bytes.
  result = result & MAX_DEVICE_ID;

  macaddr[0] = 0x00;  //we set the first byte fix, otherwise troubles with DHCP server

  memcpy(macaddr +1, &result, sizeof(result) -3);

  /*
  printdeb("MAC ADDR: ");

  for (int i = 0; i < 6; i++)
  {
    printfdeb("%02X:", macaddr[i]);
  }
  printlndeb("");
  */

  // setting now the GW-ID
  DEBUG_MSG("Radio", "Setting GW-ID");

  //memcpy makes little endian, so we need to shift bytes our self
  _GW_ID = macaddr[5] | (macaddr[4] << 8) | (macaddr[3] << 16) | (macaddr[2] << 24);

  DEBUG_MSG("Radio", "GW-ID: 0x%04X", _GW_ID);
}

/**@brief Method to renew/reset DHCP
 */
int NrfETH::resetDHCP()
{
  s_ethResets++;
  Serial.printf("[ETH];event;reset;ms;%lu\n", (unsigned long)millis());
  // stop UDP
  { EthStall st("udp_stop"); Udp.stop(); }

  //restart ETH HW Board
  //digitalWrite(WB_IO2, LOW); // disable power supply.
  //delay(500);
  //initETH_HW();

  // renew DHCP config
  int retStart = startETH();

  if(retStart == 2)
  {
    // not ETH-hardware found
    ethClearLog(567, retStart);
    hasIPaddress = false;
    return 1;
  }
  else
  if(retStart == 0)
  {
    // start UDP Service again
    startUDP();
    DEBUG_MSG("ETH", "Renew DHCP successful!\n");
  }
  else
  {
    DEBUG_MSG("ERROR", "Renew DHCP failed!\n");
    return 1;
  }

  return 0;
}

/**@brief Initialises the ETH HW
 */
void NrfETH::initETH_HW()
{
  EthStall st("hw_init");
  pinMode(WB_IO2, OUTPUT);
  digitalWrite(WB_IO2, HIGH); // Enable power supply.

  pinMode(WB_IO3, OUTPUT);
  digitalWrite(WB_IO3, LOW); // Reset Time.
  delay(100);
  digitalWrite(WB_IO3, HIGH); // Reset Time.

  delay(100);

  Ethernet.init(ETH_CS);

}


/**@brief Initialises the ETH HW
 */
int NrfETH::startETH()
{
  if(hasIPaddress)
    return 0;

  printlndeb("\nInitialize Ethernet"); // start the Ethernet connection.

  // N-20: Ohne Link ist Ethernet.begin() ein blockierender DHCP-Versuch gegen
  // ein totes Kabel (10 s Timeout, in der W5100S-Bibliothek nichtdeterministisch
  // auch deutlich laenger) — und dieser Pfad laeuft nicht nur im Setup, sondern
  // periodisch aus nrf52loop() (initethDHCP/resetDHCP alle MAX_HB_RX_TIME).
  // Der Link-Status ist ein einzelnes SPI-Registerlesen: erst pruefen und nur
  // bei vorhandenem Link den blockierenden Teil starten.
  //
  // Wichtig: die Aufrufer laufen ueber initETH_HW(), das den W5100S per
  // Hardware-Reset neu startet — die PHY-Aushandlung braucht danach 1–3 s.
  // Deshalb begrenzt auf LinkON warten (max. 3 s in 100-ms-Schritten) statt
  // sofort abzubrechen; ein Sofort-Check meldet nach dem Reset immer LinkOFF
  // und wuerde die Wiederverbindung dauerhaft verhindern (auf Hardware
  // beobachtet). Nur das explizite LinkOFF bricht ab — Unknown (z.B. Modul
  // fehlt/liefert Muell) laeuft in den bestehenden Pfad samt
  // EthernetNoHardware-Erkennung.
  EthernetLinkStatus elink = Ethernet.linkStatus();
  uint32_t linkWait = millis();
  while (elink == LinkOFF && (uint32_t)(millis() - linkWait) < 3000)
  {
    delay(100);
    elink = Ethernet.linkStatus();
  }
  if (elink == LinkOFF)
  {
    printlndeb("Ethernet link OFF - skip DHCP");
    return 2;
  }

  int dhcp_rc;
  { EthStall st("dhcp_begin"); dhcp_rc = Ethernet.begin(macaddr, 10000UL); }
  if (dhcp_rc == 0)
  {
    printlndeb("Failed to configure Ethernet using FIX/DHCP");
    if (Ethernet.hardwareStatus() == EthernetNoHardware) // Check for Ethernet hardware present.
    {
      printlndeb("Ethernet shield was not found.\nGateway or WEBService can't run without ETH-hardware.");

      hasETHHardware=false;
      
      return 2;
    }
  }

