icssw-org/MeshCom-Firmware/src/nrf52/nrf_eth.cpp
  if(Ethernet.linkStatus() == LinkOFF)
  {
    return 2;
  }

  // IPAddress dezimal ausgeben — printlndeb(Ethernet.localIP()) lief ueber die
  // implizite uint32_t-Konvertierung in die int-Ueberladung und druckte den
  // Roh-Integer (z.B. "1145350336" statt "192.168.68.68").
  printfdeb("Ethernet.localIP(): %i.%i.%i.%i\n",
            Ethernet.localIP()[0], Ethernet.localIP()[1],
            Ethernet.localIP()[2], Ethernet.localIP()[3]);

  if (Ethernet.localIP() != IPAddress(0, 0, 0, 0))
  {
    // diese Meldungen gehen nicht zu TELNET-Console
    Serial.print("\nMy IP address: ");
    Serial.println(Ethernet.localIP()); // Print your local IP address.
    Serial.print("Default GW address: ");
    Serial.println(Ethernet.gatewayIP());
    Serial.print("DNS address: ");
    Serial.println(Ethernet.dnsServerIP());
    Serial.print("SNM: ");
    Serial.println(Ethernet.subnetMask());

    snprintf(meshcom_settings.node_ip, sizeof(meshcom_settings.node_ip), "%i.%i.%i.%i", Ethernet.localIP()[0], Ethernet.localIP()[1], Ethernet.localIP()[2], Ethernet.localIP()[3]);
    snprintf(meshcom_settings.node_gw, sizeof(meshcom_settings.node_gw), "%i.%i.%i.%i", Ethernet.gatewayIP()[0], Ethernet.gatewayIP()[1], Ethernet.gatewayIP()[2], Ethernet.gatewayIP()[3]);
    snprintf(meshcom_settings.node_dns, sizeof(meshcom_settings.node_dns), "%i.%i.%i.%i", Ethernet.dnsServerIP()[0], Ethernet.dnsServerIP()[1], Ethernet.dnsServerIP()[2], Ethernet.dnsServerIP()[3]);
    snprintf(meshcom_settings.node_subnet, sizeof(meshcom_settings.node_subnet), "%i.%i.%i.%i", Ethernet.subnetMask()[0], Ethernet.subnetMask()[1], Ethernet.subnetMask()[2], Ethernet.subnetMask()[3]);

    hasIPaddress = true;
    s_ethGotIpCount++;
    s_ethLastGotIpMs = millis();
    Serial.printf("[ETH];event;got_ip;%s;ms;%lu\n", meshcom_settings.node_ip, (unsigned long)millis());

    // update phone status
    if (isPhoneReady == 1)
    {
      commandAction((char *)"--wifiset", true);
    }

    return 0;
  }
  else
  {
    DEBUG_MSG("ERROR", "ETH Config failed!");
  }
    return 1;
}

/**@brief Check DHCP Service
 */
int NrfETH::checkDHCP()
{
  int rc;
  { EthStall st("dhcp_maintain"); rc = Ethernet.maintain(); }
  if(rc == 2 || rc == 4) s_ethDhcpRenews++;
  else if(rc == 1 || rc == 3) s_ethDhcpFails++;
  if(rc != 0)
    Serial.printf("[ETH];event;dhcp;rc;%d;ms;%lu\n", rc, (unsigned long)millis());

  switch (rc)
  {
      case 0:
      // DEBUG_MSG("DHCP", "DHCP lease no action needed");
      break;
      case 1: DEBUG_MSG("DHCP", "DHCP renew failed!"); break;
      case 2: DEBUG_MSG("DHCP", "DHCP_CHECK_RENEW_OK"); break;
      case 3: DEBUG_MSG("DHCP", "DHCP rebind failed!"); break;
      case 4: DEBUG_MSG("DHCP", "DHCP_CHECK_REBIND_OK. Got new IP Addr."); break;
      default: DEBUG_MSG("DHCP", "DHCP_CHECK_FAULT"); break;
  }
  return rc;
}

/**@brief Start UDP Service
 */
void NrfETH::startUDP()
{
  // set our destination UDP Server address Hamnet / Internet
  IPAddress local_addr = Ethernet.localIP();
  
  char sn[20];
  snprintf(sn, sizeof(sn), "%i.%i.%i.%i", local_addr[0], local_addr[1], local_addr[2], local_addr[3]);
  s_node_ip=sn;

  if(local_addr[0] == 0)
  {
    // keine weiteren IP setzen
    btimeClient = false;
  }
  else
  {
    const char *srv_path = NULL;   // TM-39: "hamnet" or "inet", matches the printlndeb text below

    if (local_addr[0] == 44 || meshcom_settings.node_hamnet_only)
    {
      if(memcmp(meshcom_settings.node_gwsrv, "IT", 2) == 0)
      {
        if(bDisplayCont)
          printlndeb("[UDP-DEST] Setting I-NET UDP-DEST 145.239.75.155");

        udp_dest_addr = IPAddress(145, 239, 75, 155);
        srv_path = "inet";

        timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
      }
      else
      if(memcmp(meshcom_settings.node_gwsrv, "DL", 2) == 0)
      {
        if(bDisplayCont)
          printlndeb("[UDP-DEST] Setting Hamnet UDP-DEST 44.148.230.197");

        udp_dest_addr = IPAddress(44, 148, 230, 197);
        srv_path = "hamnet";

        //DEBUG_MSG("NTP", "Setting Hamnet NTP");
        timeClient.setPoolServerIP(IPAddress(44, 143, 0, 9));
      }
      else
      {
        if(bDisplayCont)
          printlndeb("[UDP-DEST] Setting Hamnet UDP-DEST 44.143.8.143");

        udp_dest_addr = IPAddress(44, 143, 8, 143);
        srv_path = "hamnet";

        //DEBUG_MSG("NTP", "Setting Hamnet NTP");
        timeClient.setPoolServerIP(IPAddress(44, 143, 0, 9));
      }
    }
    else
    {
      // CTY-01: mirrors the country split startFIXUDP() already has on its
      // non-hamnet branch -- this path (DHCP, no hamnet) had none and always
      // fell through to the OE default, regardless of node_gwsrv.
      if(memcmp(meshcom_settings.node_gwsrv, "IT", 2) == 0)
      {
        if(bDisplayCont)
          printlndeb("[UDP-DEST] Internet UDP-DEST IT 145.239.75.155");

        udp_dest_addr = IPAddress(145, 239, 75, 155);
        srv_path = "inet";

        timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
      }
      else
      {
        if(bDisplayCont)
          printlndeb("[UDP-DEST] Setting I-NET UDP-DEST OE 89.185.97.38");

        //DEBUG_MSG("UDP-DEST", "Setting I-NET UDP-DEST 213.47.219.169");
        udp_dest_addr = IPAddress(89, 185, 97, 38);
        srv_path = "inet";

        //DEBUG_MSG("NTP", "Setting I-NET 3.at.pool.ntp.org NTP");
        timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
      }
    }

#if INSTRUMENT_ENABLED
    // Bench hook, nRF52 half of the ESP32 `--srvip` override
    // (command_functions.cpp, applied there in wifiDnsPoll()). Unlike the
    // ESP32 path there is no DNS resolver here at all: every branch above
    // assigns a hardcoded literal, so without this the node can only ever
    // talk to a real MeshCom server and the UDP-1990 golden captures cannot
    // be driven against a local stub. RAM only, cleared by 0.0.0.0, applied
    // at the next startUDP().
    {
        if((uint32_t)bench_srvip != 0)
        {
            udp_dest_addr = bench_srvip;
            srv_path = "bench";
            Serial.printf("[SRVIP];%i.%i.%i.%i;applied\n",
                          udp_dest_addr[0], udp_dest_addr[1],
                          udp_dest_addr[2], udp_dest_addr[3]);
        }
    }
#endif

    snprintf(sn, sizeof(sn), "%i.%i.%i.%i", udp_dest_addr[0], udp_dest_addr[1], udp_dest_addr[2], udp_dest_addr[3]);
    s_node_hostip = sn;

    // TM-39: raw & unconditional, once per (re)connect. nRF52 has no DNS
    // resolver on this path -- host is always the literal dotted-quad IP,
    // never a hostname (unlike the ESP32 [GW];srv, which logs a hostname
    // for IT/DL and only falls back to a literal for the else-case).
    Serial.printf("[GW];srv;%.2s;host;%s;path;%s;ms;%lu\n",
                   meshcom_settings.node_gwsrv, s_node_hostip.c_str(), srv_path, (unsigned long)millis());

    Udp.begin(LOCAL_PORT); // Start UDP.

    DEBUG_MSG("UDP_ETH", "UDP init successful!");

    timeClient.begin();
    timeClient.setUpdateInterval(3600000);   // the 15-min caller drives it; this is the safety net

