icssw-org/MeshCom-Firmware/src/nrf52/nrf_eth.cpp
    btimeClient = true;
  }

  last_upd_timer = millis();

}

String NrfETH::udpUpdateTimeClient()
{
  if(!btimeClient)
    return "none";

  // TM-35: ask for a refresh and return at once; the reply lands in getUDP()
  EthStall st("ntp");
  timeClient.requestNow();
  timeClient.loop();

  if(!timeClient.isTimeSet())
    return "none";

  if(bDisplayInfo)
  {
    printdeb("TimeClient now (UTC): ");
    printlndeb(timeClient.getFormattedTime());
  }

  return timeClient.getFormattedTime();
}

String NrfETH::udpGetTimeClient()
{
  if(!btimeClient)
    return "none";

  timeClient.loop();

  if(!timeClient.isTimeSet())
    return "none";

  return timeClient.getFormattedTime();
}

String NrfETH::udpGetDateClient()
{
  if(!btimeClient)
    return "none";

  if(!timeClient.isTimeSet())
    return "none";

  return getDateTime(timeClient.getEpochTime());
}

void NrfETH::startFIXUDP()
{
  char sn[20];
  snprintf(sn, sizeof(sn), "%s", meshcom_settings.node_ownip);
  s_node_ip=sn;

  if (memcmp(meshcom_settings.node_ip, "44", 2) == 0 || meshcom_settings.node_hamnet_only)
  {
    if(memcmp(meshcom_settings.node_gwsrv, "IT", 2) == 0)
    {
      if(bDisplayCont)
        printlndeb("[UDP-DEST] Setting I-NET UDP-DEST 145.239.75.155");
        
      udp_dest_addr = IPAddress(145, 239, 75, 155);

      timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
    }
    else
    if(memcmp(meshcom_settings.node_gwsrv, "DL", 2) == 0)
    {
      if(bDisplayCont)
        printlndeb("[UDP-DEST] Setting Hamnet UDP-DEST 44.148.230.197");

      udp_dest_addr = IPAddress(44, 148, 230, 197);
    
      //DEBUG_MSG("NTP", "Setting Hamnet NTP");
      timeClient.setPoolServerIP(IPAddress(44, 143, 0, 9));
    }
    else
    {
      if(bDisplayCont)
        printlndeb("[UDP-DEST] Setting Hamnet UDP-DEST 44.143.8.143");

      udp_dest_addr = IPAddress(44, 143, 8, 143);
    
      //DEBUG_MSG("NTP", "Setting Hamnet NTP");
      timeClient.setPoolServerIP(IPAddress(44, 143, 0, 9));
    }

  }
  else
  {
    if(memcmp(meshcom_settings.node_gwsrv, "IT", 2) == 0)
    {
      if(bDisplayCont)
        printlndeb("[UDP-DEST] Internet UDP-DEST IT 145.239.75.155");
        
      udp_dest_addr = IPAddress(145, 239, 75, 155);

      timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
    }
    else
    {
      if(bDisplayCont)
        printlndeb("[UDP-DEST] Setting I-NET UDP-DEST OE 89.185.97.38");
        
      udp_dest_addr = IPAddress(89, 185, 97, 38);

      //DEBUG_MSG("NTP", "Setting I-NET 3.at.pool.ntp.org NTP");
      timeClient.setPoolServerIP(IPAddress(162, 159, 200, 1));
    }
  }

  snprintf(sn, sizeof(sn), "%i.%i.%i.%i", udp_dest_addr[0], udp_dest_addr[1], udp_dest_addr[2], udp_dest_addr[3]);
  s_node_hostip = sn;

  Udp.begin(LOCAL_PORT); // Start UDP.

  printdeb("[UDP_ETH]...UDP init successful - Port:");
  printlndeb(LOCAL_PORT);

  timeClient.begin();
  timeClient.setUpdateInterval(3600000);   // the 15-min caller drives it; this is the safety net

  btimeClient = true;

}

#if INSTRUMENT_ENABLED
// Defined out of line, after NrfETH and the `neth` instance are both complete.
void nrfEthRestartUDP()
{
    extern NrfETH neth;
    neth.startUDP();
}
#endif
